ckflight/STM32N6570-ThreadX-USB-CDC-AI-Face-Detection/FSBL/Application/User/Core/Src/main.c
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /*
     * XSPI clocks identical to Face Detection.
     */
    RCC_PeriphCLKInitStruct.PeriphClockSelection =
        RCC_PERIPHCLK_XSPI1 |
        RCC_PERIPHCLK_XSPI2;

    RCC_PeriphCLKInitStruct.Xspi1ClockSelection =
        RCC_XSPI1CLKSOURCE_HCLK;

    RCC_PeriphCLKInitStruct.Xspi2ClockSelection =
        RCC_XSPI2CLKSOURCE_HCLK;

    if (HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct) != HAL_OK)
    {
        Error_Handler();
    }
}
//void SystemClock_Config(void)
//{
//  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
//  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
//  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
//
//  /** Configure the System Power Supply
//  */
//  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  /** Configure the main internal regulator output voltage
//  */
//  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  /* Enable HSI */
//  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
//  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
//  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
//  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
//  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
//  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
//  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
//  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
//  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  /* Wait HSE stabilization time before its selection as PLL source. */
//  HAL_Delay(HSE_STARTUP_TIMEOUT);
//
//  /** Initializes TIMPRE when TIM is used as Systick Clock Source
//  */
//  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_TIM;
//  PeriphClkInitStruct.TIMPresSelection = RCC_TIMPRES_DIV1;
//  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  /** Get current CPU/System buses clocks configuration and if necessary switch
// to intermediate HSI clock to ensure target clock can be set
//  */
//  HAL_RCC_GetClockConfig(&RCC_ClkInitStruct);
//  if ((RCC_ClkInitStruct.CPUCLKSource == RCC_CPUCLKSOURCE_IC1) ||
//     (RCC_ClkInitStruct.SYSCLKSource == RCC_SYSCLKSOURCE_IC2_IC6_IC11))
//  {
//    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK);
//    RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_HSI;
//    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
//    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
//    {
//      /* Initialization Error */
//      Error_Handler();
//    }
//  }
//
//  /** Initializes the RCC Oscillators according to the specified parameters
//  * in the RCC_OscInitTypeDef structure.
//  */
//  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
//  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS_DIGITAL;
//  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
//  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSE;
//  RCC_OscInitStruct.PLL1.PLLM = 3;
//  RCC_OscInitStruct.PLL1.PLLN = 75;
//  RCC_OscInitStruct.PLL1.PLLFractional = 0;
//  RCC_OscInitStruct.PLL1.PLLP1 = 1;
//  RCC_OscInitStruct.PLL1.PLLP2 = 1;
//  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
//  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
//  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
//  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
//  {
//    Error_Handler();
//  }
//
//  /** Initializes the CPU, AHB and APB buses clocks
//  */
//  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK|RCC_CLOCKTYPE_HCLK
//                              |RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
//                              |RCC_CLOCKTYPE_PCLK2|RCC_CLOCKTYPE_PCLK5
//                              |RCC_CLOCKTYPE_PCLK4;
//  RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
//  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
//  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV4;
//  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
//  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
//  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
//  RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;
//  RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
//  RCC_ClkInitStruct.IC1Selection.ClockDivider = 2;
//  RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
//  RCC_ClkInitStruct.IC2Selection.ClockDivider = 3;
//  RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
//  RCC_ClkInitStruct.IC6Selection.ClockDivider = 3;
//  RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
//  RCC_ClkInitStruct.IC11Selection.ClockDivider = 3;
//
//  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
//  {
//    Error_Handler();
//  }
//}

/**
  * @brief RIF Initialization Function
  * @param None
  * @retval None
  */
static void SystemIsolation_Config(void)
{

/* USER CODE BEGIN RIF_Init 0 */

/* USER CODE END RIF_Init 0 */

  /* set all required IPs as secure privileged */
  __HAL_RCC_RIFSC_CLK_ENABLE();

  /*RIMC configuration*/
  RIMC_MasterConfig_t RIMC_master = {0};
  RIMC_master.MasterCID = RIF_CID_1;
  RIMC_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;

  HAL_RIF_RIMC_ConfigMasterAttributes(
      RIF_MASTER_INDEX_NPU,
      &RIMC_master
  );

  HAL_RIF_RISC_SetSlaveSecureAttributes(
      RIF_RISC_PERIPH_INDEX_NPU,
      RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV
  );

  HAL_RIF_RIMC_ConfigMasterAttributes(
      RIF_MASTER_INDEX_DCMIPP,
      &RIMC_master
  );

  HAL_RIF_RISC_SetSlaveSecureAttributes(
      RIF_RISC_PERIPH_INDEX_CSI,
      RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV
  );

  HAL_RIF_RISC_SetSlaveSecureAttributes(
      RIF_RISC_PERIPH_INDEX_DCMIPP,
      RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV
  );

  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_OTG1, &RIMC_master);

  /*RISUP configuration*/
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_OTG1HS , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_ADC12 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);

  /* RIF-Aware IPs Config */

  /* set up GPIO configuration */
  HAL_GPIO_ConfigPinAttributes(GPIOA,GPIO_PIN_0,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOA,GPIO_PIN_1,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOC,GPIO_PIN_1,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOC,GPIO_PIN_13,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOE,GPIO_PIN_5,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOE,GPIO_PIN_6,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOF,GPIO_PIN_11,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOG,GPIO_PIN_10,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOH,GPIO_PIN_9,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPION,GPIO_PIN_12,GPIO_PIN_SEC|GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOO,GPIO_PIN_1,GPIO_PIN_SEC|GPIO_PIN_NPRIV);

/* USER CODE BEGIN RIF_Init 1 */

